"""
日期格式标准化

目标：将字符串中日期格式化为：2022-07-15
"""
import re

content = '''
白日2022/07/15依山尽，黄河2022.07.15入海流。
欲穷07-15/2022千里目，更上7/15/2022一层楼。
'''

if __name__ == '__main__':
    result = re.sub(r'(\d{4})/(\d{2})/(\d{2})', r'\1-\2-\3', content)  # 替换 2022/07/15 格式
    result = re.sub(r'(\d{4})\.(\d{2})\.(\d{2})', r'\1-\2-\3', result)  # 替换 2022.07.15 格式
    result = re.sub(r'(\d{2})-(\d{2})/(\d{4})', r'\3-\1-\2', result)  # 替换 07-15/2022 格式
    result = re.sub(r'(\d+)/(\d+)/(\d{4})', r'\3-0\1-\2', result)  # 替换 7/15/2022 格式
    print(result)
